package com.chelimo.A01myCollection.a08RegexDemoTest2;

public class RegexDemo1 {
    public static void main(String[] args) {
//        正则表达式练习:
//        需求
//        请编写正则表达式验证用户名是否满足要求。
//        要求:大小写字母，数字，下划线一共4-16位
//        请编写正则表达式验证身份证号码是否满足要求。
//        简单要求:18位，前17位任意数字，最后一位可以是数字可以是大写或小写的x
//        复杂要求:按照身份证号码的格式严格要求。

//        41080119930228457x
//        510801197609022309
//        15040119810705387X
//        130133197204039024
//        430102197606046442

        //用户名：要求:大小写字母，数字，下划线一共4-16位
        String regex1 = "\\w{4,16}"; //或者 [a-zA-Z0-9]
        System.out.println("UNK_LGW".matches(regex1));//true
        System.out.println("UNK$w".matches(regex1));//false
        System.out.println("---------------------------");

        //身份证号码的简单校验
        //要求:18位，前17位任意数字，最后一位可以是数字可以是大写或小写的x
        String regex2 = "[1-9]\\d{16}(\\d|X|x)";//第一种写法 小括号表示一个
        String regex3 = "[1-9]\\d{16}[\\dXx]";//第二种写法
        //1.写在中间：(?i)
        //只对它后面的内容生效，一直生效到这一组结束，不是只对一个字母。
        String regex4 = "[1-9]\\d{16}(\\d|(?i)X)";//第三种写法
        //注意：(?i)不能写在[]里面，否则就从【开关】变成了【字符】
        System.out.println("41080119930228457x".matches(regex4));
        System.out.println("510801197609022309".matches(regex4));
        System.out.println("15040119810705387X".matches(regex4));

        //身份证号码的严格校验
        //410801 1993 02 28 457x
        //面6位:省份，市区，派出所等信息
        //第一位不能是0，后面5位是任意数字         [1-9][0-9]{5}
        //年的前半段:18 19 20                    (18|19|20)
        //年的后半段:任意数字出现两次                [1-9]{2}
        //月份:01 ~ 09 10 11 12                   (0[1-9]|1[0-2])
        //日期:01 ~ 31                            (0[1-9]|1[0-9]|2[0-9]|3[0-1])
        //后面四位:任意数字出现3次 最后一位可以是数字也可以是大写x或者小写x       \\d{3}(?i)x

        System.out.println("--------------------------");
        String regex5 = "[1-9]\\d{5}(18|19|20)\\d{2}(0[1-9]|1[0-2])(0[1-9]|[12]\\d|3[0-1])\\d{3}(?i)x";
        System.out.println("41080119930228457x".matches(regex5));
        System.out.println("510801197609022309".matches(regex5));
        System.out.println("15040119810705387X".matches(regex5));
    }
}
